import 'dart:io';

void main() {
  print("Enter Number: ");
  int? number = int.parse(stdin.readLineSync()!);
  print("The entered number : ${number}");
}


// 기본 다트 연습 질문
// Dart에 이름을 출력하는 프로그램을 작성하세요.


// 1.int 설정값의 상수형 선언 7.
// 2.간단한 관심을 찾는 프로그램을 Dart로 작성하십시오.Formula= (p * t * r) / 100
// 3.사용자가 입력한 정수를 출력하는 프로그램을 작성하세요.
// 4.사용자가 입력한 문자열을 출력하는 프로그램을 작성하세요.
// 5.두 개의 부동 소수점 숫자를 곱하는 프로그램을 작성하십시오.
// 6.두 정수의 몫과 나머지를 구하는 프로그램을 작성하세요.
// 7.두 수를 교환하는 프로그램을 작성하세요.
// 8.숫자의 제곱을 계산하는 프로그램을 작성하십시오.
// 9.문자열에서 모든 공백을 제거하는 프로그램을 Dart에 작성하십시오.
// 10.String을 int로 변환하는 dart 프로그램을 작성하세요.